Catalogs/НастройкиПарсингаДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>НастройкиПарсингаДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЧитаемыеСимволы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаСловаВСимволах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДОСодержит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДОДата</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДОДатаДМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДООдин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДОЧерезКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КАДатаРождения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаИннСнилс</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КАОдин</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалятьВременныеФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаглавныеБуквыЦифры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДокументовПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказатьДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьКонтрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМожетСодержатьТочку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВложенныеКаталоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыЭлДок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлДок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыПрикрепляемыхФайлов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СжиматьИзображаниеДляПросмотра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьНа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ImageMagickConvert</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Tesseract</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсеСтраницы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИЛПерваяСтраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИЛПятаяСтраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиПарсингаДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	Объект.ЧитаемыеСимволы = " абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789-/";
	Объект.ДлинаСловаВСимволах = 0;
	Объект.ДоСтраницы = 1;
	Если Объект.ВидНастройки = "1" Тогда
		Объект.ЗаглавныеБуквыЦифры = Истина;
	КонецЕсли;
	Объект.ИсключитьДО = Истина;
	Объект.ИсключитьКонтрагент = Истина;
	Если Объект.ВидНастройки = "2" Тогда
		Объект.ТипыПрикрепляемыхФайлов = ТипПрикрепляемыхФайловИсполнительныйДокумент();
		Объект.ИЛПерваяСтраница = 1;
		Объект.ИЛПятаяСтраница = 5;
	КонецЕсли;
	Объект.СжиматьИзображаниеДляПросмотра = Истина;
	Объект.Ширина = "827";
	Объект.Высота = "1169";
КонецПроцедуры

&НаСервере
Функция ТипПрикрепляемыхФайловИсполнительныйДокумент()

	Возврат Справочники.ТипыПрикрепляемыхФайлов.ИсполнительныйДокумент; 

КонецФункции // ТипФайла()

&НаКлиенте
Процедура ДОДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДОДата) Тогда
		Объект.ДОДатаДМ = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоговораМикрозаймаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДОДатаДМ) Тогда
		Объект.ДОДата = Неопределено;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогДокументовПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Диалог.Выбрать() Тогда
		Объект.КаталогДокументовПоУмолчанию = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНастройки) Тогда
		Объект.ВидНастройки = "1";	
	КонецЕсли;
	
	Если Объект.Контрагенты Тогда
		Элементы.ИсполнительныеДокументы.Доступность = Истина;	
		Элементы.ИсполнительноеПроизводство.Доступность = Истина;
	КонецЕсли;

	Если Объект.ВидНастройки = "2" Тогда
		Элементы.ДлинаСловаВСимволах.Видимость = Ложь;	
		Элементы.ДоСтраницы.Видимость = Ложь;
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Ложь;
		Элементы.Контрагенты.Видимость = Ложь;
		Элементы.КАИЛИ.Видимость = Ложь;
		Элементы.КАИНН.Видимость = Ложь;
		Элементы.КАОдин.Видимость = Ложь;
		Элементы.ИсключитьКонтрагент.Видимость = Ложь;
		Элементы.ИсключитьДО.Видимость = Ложь;
		Элементы.НомерМожетСодержатьТочку.Видимость = Ложь;
		Элементы.ТипыЭлДок.Видимость = Ложь;
		Элементы.ГруппаИЛСтраницы.Видимость = Истина;
		Если Объект.ВсеСтраницы Тогда
			Элементы.ИЛПерваяСтраница.Доступность = Ложь;
			Элементы.ИЛПятаяСтраница.Доступность = Ложь;		
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВыполнятьНа) Тогда
		Объект.ВыполнятьНа = "1";	
	КонецЕсли;
	
	Если Объект.ВыполнятьНа = "2" Тогда
		Элементы.ImageMagickConvert.Видимость = Истина;	
		Элементы.Tesseract.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Объект.Контрагенты Тогда
		Элементы.ИсполнительныеДокументы.Доступность = Истина;	
		Элементы.ИсполнительноеПроизводство.Доступность = Истина;
		Элементы.ДОЧерезКонтрагента.Доступность = Истина;
	Иначе
		Объект.ИсполнительныеДокументы = Ложь;
		Элементы.ИсполнительныеДокументы.Доступность = Ложь;	
		Объект.ИсполнительноеПроизводство = Ложь;
		Элементы.ИсполнительноеПроизводство.Доступность = Ложь;
		Объект.ДОЧерезКонтрагента = Ложь;
		Элементы.ДОЧерезКонтрагента.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Найти(Объект.ЧитаемыеСимволы,".") > 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Точку запрещенно добавлять в читаемые символы, добавьте точку проблел "". "" в ""Варианты исключения точки""";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура TesseractНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Объект.Tesseract = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ImageMagickConvertНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Если Диалог.Выбрать() Тогда
		Объект.ImageMagickConvert = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьНаПриИзменении(Элемент)
	Если Объект.ВыполнятьНа = "2" Тогда
		Элементы.ImageMagickConvert.Видимость = Истина;	
		Элементы.Tesseract.Видимость = Истина;
	Иначе
		Элементы.ImageMagickConvert.Видимость = Ложь;	
		Элементы.Tesseract.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидНастройкиПриИзменении(Элемент)
	Если Объект.ВидНастройки = "2" Тогда
		Элементы.ДлинаСловаВСимволах.Видимость = Ложь;	
		Элементы.ДоСтраницы.Видимость = Ложь;
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Ложь;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Ложь;
		Элементы.Контрагенты.Видимость = Ложь;
		Элементы.КАИЛИ.Видимость = Ложь;
		Элементы.КАИНН.Видимость = Ложь;
		Элементы.КАОдин.Видимость = Ложь;
		Элементы.ИсключитьКонтрагент.Видимость = Ложь;
		Элементы.ИсключитьДО.Видимость = Ложь;
		Элементы.НомерМожетСодержатьТочку.Видимость = Ложь;
		Элементы.ТипыЭлДок.Видимость = Ложь;
		Элементы.ГруппаИЛСтраницы.Видимость = Истина;
		Если Объект.ВсеСтраницы Тогда
			Элементы.ИЛПерваяСтраница.Доступность = Ложь;
			Элементы.ИЛПятаяСтраница.Доступность = Ложь;		
		КонецЕсли;
	Иначе
		Элементы.ДлинаСловаВСимволах.Видимость = Истина;	
		Элементы.ДоСтраницы.Видимость = Истина;
		Элементы.ГруппаПоискВДолговыхОбязательствах.Видимость = Истина;
		Элементы.ГруппаПоискВИсполнительныеДокументы.Видимость = Истина;
		Элементы.ГруппаПоискВИсполнительноеПроизводство.Видимость = Истина;
		Элементы.Контрагенты.Видимость = Истина;
		Элементы.КАИЛИ.Видимость = Истина;
		Элементы.КАИНН.Видимость = Истина;
		Элементы.КАОдин.Видимость = Истина;
		Элементы.ИсключитьКонтрагент.Видимость = Истина;
		Элементы.ИсключитьДО.Видимость = Истина;
		Элементы.НомерМожетСодержатьТочку.Видимость = Истина;
		Элементы.ТипыЭлДок.Видимость = Истина;
		Элементы.ГруппаИЛСтраницы.Видимость = Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВсеСтраницыПриИзменении(Элемент)
	Если Объект.ВсеСтраницы Тогда
		Элементы.ИЛПерваяСтраница.Доступность = Ложь;
		Элементы.ИЛПятаяСтраница.Доступность = Ложь;
	Иначе
		Элементы.ИЛПерваяСтраница.Доступность = Истина;
		Элементы.ИЛПятаяСтраница.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры
